In [74]:
import pyforest

In [75]:
date = pd.read_csv(r'D:\Machine Learning\Machine-Learning\Data\orders.csv')
time = pd.read_csv(r'D:\Machine Learning\Machine-Learning\Data\messages.csv')

In [76]:
print(date)
print(time)

           date  product_id  city_id  orders
0    2019-12-10        5628       25       3
1    2018-08-15        3646       14     157
2    2018-10-23        1859       25       1
3    2019-08-17        7292       25       1
4    2019-01-06        4344       25       3
..          ...         ...      ...     ...
995  2018-10-08         255       13       1
996  2018-12-06        5521        7       1
997  2019-05-07         487       26      14
998  2019-03-03        1503       21       2
999  2019-10-15        6371        7      22

[1000 rows x 4 columns]
                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [77]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

# Working with dates

In [78]:
date['date']=pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# Extract Year

In [79]:
date['year']=date['date'].dt.year
date.head()

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

# To extract month

In [80]:
date['month']=date['date'].dt.month
date.head()

        date  product_id  city_id  orders  year  month
0 2019-12-10        5628       25       3  2019     12
1 2018-08-15        3646       14     157  2018      8
2 2018-10-23        1859       25       1  2018     10
3 2019-08-17        7292       25       1  2019      8
4 2019-01-06        4344       25       3  2019      1

In [81]:
date['month_name']=date['date'].dt.month_name()
date.head()

        date  product_id  city_id  orders  year  month month_name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

# Extract days

In [82]:
date['day']=date['date'].dt.day
date.head()

        date  product_id  city_id  orders  year  month month_name  day
0 2019-12-10        5628       25       3  2019     12   December   10
1 2018-08-15        3646       14     157  2018      8     August   15
2 2018-10-23        1859       25       1  2018     10    October   23
3 2019-08-17        7292       25       1  2019      8     August   17
4 2019-01-06        4344       25       3  2019      1    January    6

In [83]:
# day of the week
date['date_dow']=date['date'].dt.dayofweek
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [84]:
# day of week - name
date['day name']=date['date'].dt.day_name()
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,date_dow,day name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [85]:
# Is weekend
date['date_is_weekend'] = np.where(date['day name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,date_dow,day name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [86]:
import datetime

In [87]:
today=datetime.datetime.today()
today

datetime.datetime(2024, 2, 22, 6, 47, 5, 554559)

In [88]:
today-date['date']

0     1535 days 06:47:05.554559
1     2017 days 06:47:05.554559
2     1948 days 06:47:05.554559
3     1650 days 06:47:05.554559
4     1873 days 06:47:05.554559
                 ...
995   1963 days 06:47:05.554559
996   1904 days 06:47:05.554559
997   1752 days 06:47:05.554559
998   1817 days 06:47:05.554559
999   1591 days 06:47:05.554559
Name: date, Length: 1000, dtype: timedelta64[ns]

In [89]:
(today-date['date']).dt.days

0      1535
1      2017
2      1948
3      1650
4      1873
       ...
995    1963
996    1904
997    1752
998    1817
999    1591
Name: date, Length: 1000, dtype: int64

In [90]:
# Months passed
np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      50.0
1      65.0
2      63.0
3      53.0
4      60.0
       ...
995    63.0
996    61.0
997    57.0
998    59.0
999    51.0
Name: date, Length: 1000, dtype: float64

# Time

In [91]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [94]:
time['date']=pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [100]:
time['hour']=time['date'].dt.hour
time['min']=time['date'].dt.minute
time['sec']=time['date'].dt.second
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

# Time difference

In [101]:
today-time['date']

0     3721 days 05:57:05.554559
1     3585 days 07:07:05.554559
2     4071 days 06:26:05.554559
3     3373 days 06:16:05.554559
4     3770 days 07:36:05.554559
                 ...
995   4360 days 05:57:05.554559
996   3681 days 07:33:05.554559
997   4146 days 07:10:05.554559
998   4262 days 07:13:05.554559
999   3534 days 07:22:05.554559
Name: date, Length: 1000, dtype: timedelta64[ns]

In [102]:
# in seconds
(today - time['date'])/np.timedelta64(1,'s')

0      3.215158e+08
1      3.097696e+08
2      3.517576e+08
3      2.914498e+08
4      3.257554e+08
           ...
995    3.767254e+08
996    3.180656e+08
997    3.582402e+08
998    3.682628e+08
999    3.053641e+08
Name: date, Length: 1000, dtype: float64

In [103]:
# in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      5.358597e+06
1      5.162827e+06
2      5.862626e+06
3      4.857496e+06
4      5.429256e+06
           ...
995    6.278757e+06
996    5.301093e+06
997    5.970670e+06
998    6.137713e+06
999    5.089402e+06
Name: date, Length: 1000, dtype: float64

In [104]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0       89309.951543
1       86047.118210
2       97710.434876
3       80958.268210
4       90487.601543
           ...
995    104645.951543
996     88351.551543
997     99511.168210
998    102295.218210
999     84823.368210
Name: date, Length: 1000, dtype: float64